In [3]:
import pandas as pd
from pandas import Series, DataFrame

In [5]:
s = Series([10, 20, 30, 40, 50], dtype='int8')
s

0    10
1    20
2    30
3    40
4    50
dtype: int8

In [6]:
s * 2

0     20
1     40
2     60
3     80
4    100
dtype: int8

In [27]:
s + 128 # promotes

0    138
1    148
2    158
3    168
4    178
dtype: int16

In [34]:
# create DF
df = DataFrame([[10,20,30],
                [40,50,60],
                [70,80,90],
                [100,110,120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [70]:
df = DataFrame([[10,20,30],
                [40,50,60],
                [70,80,90],
                [100,110,120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [44]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [51]:
df.loc['c']

x    70
y    80
z    90
Name: c, dtype: int64

In [53]:
df.loc[['a','c']]

    x   y   z
a  10  20  30
c  70  80  90

In [54]:
# to retrieve columns, don't use .loc
df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [55]:
df['x'].mean()

55.0

In [56]:
df.mean()

x    55.0
y    65.0
z    75.0
dtype: float64

In [57]:
df.sum()

x    220
y    260
z    300
dtype: int64

In [58]:
df.sum().sum()

780

In [61]:
df.min()

x    10
y    20
z    30
dtype: int64

In [62]:
df['x'].describe()

count      4.000000
mean      55.000000
std       38.729833
min       10.000000
25%       32.500000
50%       55.000000
75%       77.500000
max      100.000000
Name: x, dtype: float64

In [65]:
df.describe()

                x           y           z
count    4.000000    4.000000    4.000000
mean    55.000000   65.000000   75.000000
std     38.729833   38.729833   38.729833
min     10.000000   20.000000   30.000000
25%     32.500000   42.500000   52.500000
50%     55.000000   65.000000   75.000000
75%     77.500000   87.500000   97.500000
max    100.000000  110.000000  120.000000

In [66]:
df.mean(axis='columns')

a     20.0
b     50.0
c     80.0
d    110.0
dtype: float64

In [71]:
df['n'] = 'hello to you all'.split()
df

     x    y    z      n
a   10   20   30  hello
b   40   50   60     to
c   70   80   90    you
d  100  110  120    all

In [89]:
df = DataFrame([[15, 11], [16, 8], [16, 9], [19, 9], [20, 9], [18, 7]],
                  index=['Mon', 'Tues', 'Weds', 'Thurs', 'Fri', 'Sat'],
                  columns=['High', 'Low'])
df

       High  Low
Mon      15   11
Tues     16    8
Weds     16    9
Thurs    19    9
Fri      20    9
Sat      18    7

In [91]:
df['High'].describe()

count     6.000000
mean     17.333333
std       1.966384
min      15.000000
25%      16.000000
50%      17.000000
75%      18.750000
max      20.000000
Name: High, dtype: float64

In [92]:
df['Low'].describe()

count     6.000000
mean      8.833333
std       1.329160
min       7.000000
25%       8.250000
50%       9.000000
75%       9.000000
max      11.000000
Name: Low, dtype: float64

In [94]:
df.loc[['Weds','Fri']].mean()

High    18.0
Low      9.0
dtype: float64

In [99]:
df['Precipitation'] = [90, 60, 60, 50, 20, 20]
df

       High  Low  Precipitation
Mon      15   11             90
Tues     16    8             60
Weds     16    9             60
Thurs    19    9             50
Fri      20    9             20
Sat      18    7             20

In [102]:
!ls ../data/*.csv

../data/2020_sharing_data_outside.csv  ../data/olympic_athlete_events.csv
../data/CPILFESL.csv		       ../data/san+francisco,ca.csv
../data/albany,ny.csv		       ../data/sat-scores.csv
../data/boston,ma.csv		       ../data/skyscrapers.csv
../data/burrito_current.csv	       ../data/springfield,il.csv
../data/celebrity_deaths_2016.csv      ../data/springfield,ma.csv
../data/chicago,il.csv		       ../data/taxi-distance.csv
../data/eu_cpi.csv		       ../data/taxi-passenger-count.csv
../data/eu_gdp.csv		       ../data/taxi.csv
../data/ice-cream.csv		       ../data/titanic3.csv
../data/languages.csv		       ../data/us-median-cpi.csv
../data/los+angeles,ca.csv	       ../data/us-unemployment-rate.csv
../data/miles-traveled.csv	       ../data/us_gdp.csv
../data/new+york,ny.csv		       ../data/winemag-150k-reviews.csv
../data/oecd_locations.csv	       ../data/wti-daily.csv
../data/oecd_tourism.csv

In [104]:
df = pd.read_csv('../data/taxi.csv')
df.shape

(9999, 19)

In [105]:
df['trip_distance']

0       1.63
1       0.46
2       0.87
3       2.13
4       1.40
        ...
9994    2.70
9995    4.50
9996    5.59
9997    1.54
9998    5.80
Name: trip_distance, Length: 9999, dtype: float64

In [111]:
df['trip_distance'][df['passenger_count'] == 3]

10       0.01
67       2.50
82      10.24
126      1.06
192      0.60
        ...
9837     1.50
9888     6.00
9914     2.44
9946     5.00
9983     1.78
Name: trip_distance, Length: 406, dtype: float64

In [112]:
(
    df
    ['trip_distance']
        [df
        ['passenger_count'] == 3
        ]
)

10       0.01
67       2.50
82      10.24
126      1.06
192      0.60
        ...
9837     1.50
9888     6.00
9914     2.44
9946     5.00
9983     1.78
Name: trip_distance, Length: 406, dtype: float64

In [114]:
df.loc[
    df['passenger_count'] == 3  # row selector
    ,
    ['trip_distance']           # column selector
]

      trip_distance
10             0.01
67             2.50
82            10.24
126            1.06
192            0.60
...             ...
9837           1.50
9888           6.00
9914           2.44
9946           5.00
9983           1.78

[406 rows x 1 columns]

In [119]:
df1 = df[['trip_distance', 'total_amount', 'passenger_count']]
df1

      trip_distance  total_amount  passenger_count
0              1.63         17.80                1
1              0.46          8.30                1
2              0.87         11.00                1
3              2.13         17.16                1
4              1.40         10.30                1
...             ...           ...              ...
9994           2.70         12.30                1
9995           4.50         20.30                1
9996           5.59         22.30                1
9997           1.54          7.80                6
9998           5.80         26.75                1

[9999 rows x 3 columns]

In [132]:
df1.loc[
    df1['passenger_count'] == 1
    ,
    ['trip_distance' , 'total_amount']
].mean()

trip_distance     3.092338
total_amount     17.368569
dtype: float64

In [131]:
df1.loc[
    (df1['passenger_count'] == 1) | (df1['passenger_count'] == 2)
    ,
    ['trip_distance' , 'total_amount']
]

      trip_distance  total_amount
0              1.63         17.80
1              0.46          8.30
2              0.87         11.00
3              2.13         17.16
4              1.40         10.30
...             ...           ...
9993           4.10         18.30
9994           2.70         12.30
9995           4.50         20.30
9996           5.59         22.30
9998           5.80         26.75

[8520 rows x 2 columns]

In [130]:
df1.loc[
    (df1['passenger_count'] == 1) | (df1['passenger_count'] == 2)
    ,
    ['trip_distance' , 'total_amount']
].mean()

trip_distance     3.137345
total_amount     17.528493
dtype: float64

In [135]:
# loading CSV, add use_cols keyword index.

a = pd.read_csv('../data/taxi.csv', usecols=['trip_distance', 'total_amount', 'passenger_count'])
a

      passenger_count  trip_distance  total_amount
0                   1           1.63         17.80
1                   1           0.46          8.30
2                   1           0.87         11.00
3                   1           2.13         17.16
4                   1           1.40         10.30
...               ...            ...           ...
9994                1           2.70         12.30
9995                1           4.50         20.30
9996                1           5.59         22.30
9997                6           1.54          7.80
9998                1           5.80         26.75

[9999 rows x 3 columns]

In [142]:
# locate using isin instead of 1 | (OR) 2
df1.loc[
    df1['passenger_count'].isin([1,2])
    ,
    ['trip_distance' , 'total_amount']
]

      trip_distance  total_amount
0              1.63         17.80
1              0.46          8.30
2              0.87         11.00
3              2.13         17.16
4              1.40         10.30
...             ...           ...
9993           4.10         18.30
9994           2.70         12.30
9995           4.50         20.30
9996           5.59         22.30
9998           5.80         26.75

[8520 rows x 2 columns]

In [147]:
# trigger a weird warning
df = DataFrame([[10,20,30],
                [40,50,60],
                [70,80,90],
                [100,110,120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [148]:
df.loc['a','y'] = 9999
df

     x     y    z
a   10  9999   30
b   40    50   60
c   70    80   90
d  100   110  120